<a href="https://colab.research.google.com/github/sherjahong1r/my-data-sayns-lessons/blob/main/3_Lug'atdan_Series_yaratish.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
from pandas import Series

In [ ]:
obj2=Series([6, 3, 4, 5, 1], index=['a', 'b', 'c', 'd', 'e']) # bu orqali Indexlarni o'zimiz yaratamiz

In [ ]:
print(obj2)

a    6
b    3
c    4
d    5
e    1
dtype: int64

In [ ]:
np.exp(obj2)

a    403.428793
b     20.085537
c     54.598150
d    148.413159
e      2.718282
dtype: float64

In [ ]:
obj2

a    6
b    3
c    4
d    5
e    1
dtype: int64

In [ ]:
cars_dict = {'Malibu':40000, 'Lacetti':20000, 'Toyota':45000, 'Mazda':52000, 'Honda':38000}

In [ ]:
type(cars_dict)

dict

In [ ]:
cars1 = Series(cars_dict)

In [ ]:
cars1

Malibu     40000
Lacetti    20000
Toyota     45000
Mazda      52000
Honda      38000
dtype: int64

In [ ]:
type(cars1)

pandas.core.series.Series

In [ ]:
cars1 = Series({'Malibu':40000, 'Lacetti':20000, 'Toyota':45000, 'Mazda':52000, 'Honda':38000})

In [ ]:
cars1

Malibu     40000
Lacetti    20000
Toyota     45000
Mazda      52000
Honda      38000
dtype: int64

In [ ]:
'Malibu' in cars1

True

In [ ]:
"Nexia" in cars1

False

In [ ]:
cars1['Toyota']

np.int64(45000)

In [ ]:
cars_dict

{'Malibu': 40000,
 'Lacetti': 20000,
 'Toyota': 45000,
 'Mazda': 52000,
 'Honda': 38000}

In [ ]:
models = ['Honda', 'Mazda', 'Lacetti', 'Jaguar', 'Malibu', 'Toyota', 'BMW', 'Mercedes'] # Yuqoridagi cars1 ichiga yangi modellar qo'shilib ro'yxat yaratildi

In [ ]:
cars2 = Series(cars_dict, index=models) # Hamda index ni models bo'yicha o'qi va yangi mashinalar narxi bo'lmagani uchun o'rnini non qiladi

In [ ]:
cars2

Honda       38000.0
Mazda       52000.0
Lacetti     20000.0
Jaguar          NaN
Malibu      40000.0
Toyota      45000.0
BMW             NaN
Mercedes        NaN
dtype: float64

# Bu yerdan 3 - dars boshlangan yuqoridagi 2 - dars edi.

In [ ]:
cars2.isnull() # Qiymati yo'q mashinalarni True deb chiqaradi

Honda       False
Mazda       False
Lacetti     False
Jaguar       True
Malibu      False
Toyota      False
BMW          True
Mercedes     True
dtype: bool

In [ ]:
cars2.notnull() # Bu yuqoridagining aksi

Honda        True
Mazda        True
Lacetti      True
Jaguar      False
Malibu       True
Toyota       True
BMW         False
Mercedes    False
dtype: bool

In [ ]:
cars1

Malibu     40000
Lacetti    20000
Toyota     45000
Mazda      52000
Honda      38000
dtype: int64

In [ ]:
cars2

Honda       38000.0
Mazda       52000.0
Lacetti     20000.0
Jaguar          NaN
Malibu      40000.0
Toyota      45000.0
BMW             NaN
Mercedes        NaN
dtype: float64

In [ ]:
cars1 + cars2 # Bunda cars1 va cars2 ning joyi chalkashgan bo'lsa ham qiymati va nomi tenglarni qo'shadi

BMW              NaN
Honda        76000.0
Jaguar           NaN
Lacetti      40000.0
Malibu       80000.0
Mazda       104000.0
Mercedes         NaN
Toyota       90000.0
dtype: float64

In [ ]:
cars2.name = 'Avtosalon'

In [ ]:
cars2.index.name = 'Modellar'

In [ ]:
cars2 # Bunda nomini avtosalon va indexni modellar deb chiqaradi yuqoridagilar asosida.

Modellar
Honda       38000.0
Mazda       52000.0
Lacetti     20000.0
Jaguar          NaN
Malibu      40000.0
Toyota      45000.0
BMW             NaN
Mercedes        NaN
Name: Avtosalon, dtype: float64

## Series obyektiga oid ba'zi parametrlar va metodlar

## Series obyektining o'zini ham indekslarini ham nomlash mumkin:

In [ ]:
cars2.name = 'Avtosalon'

In [ ]:
cars2.index.name = 'Car Model'

In [ ]:
cars2

Car Model
Honda       38000.0
Mazda       52000.0
Lacetti     20000.0
Jaguar          NaN
Malibu      40000.0
Toyota      45000.0
BMW             NaN
Mercedes        NaN
Name: Avtosalon, dtype: float64

In [ ]:
cars2.name

'Avtosalon'

In [ ]:
cars2.index # indekslar

Index(['Honda', 'Mazda', 'Lacetti', 'Jaguar', 'Malibu', 'Toyota', 'BMW',
       'Mercedes'],
      dtype='object', name='Car Model')

In [ ]:
cars2.values # qiymatlar

array([38000., 52000., 20000.,    nan, 40000., 45000.,    nan,    nan])

In [ ]:
cars2.hasnans # NaN qiymatlar bor (True) yo'qligi (False)

True

In [ ]:
cars2.dtype # qiymatlarning ma'lumot turi

dtype('float64')

In [ ]:
cars2.is_unique # qiymatlar takrorlanmas ekanini tekshirish

False

In [ ]:
cars2.shape # Series hajmi

(8,)

In [ ]:
cars2.size # Series hajmi

8

In [ ]:
cars2.iloc[2] # ma'lumotlarga indeks tartib raqami bo'yicha murojaat qilish

np.float64(20000.0)

In [ ]:
cars2.iloc[-1]

np.float64(nan)

In [ ]:
cars2['Honda'] # ma'lumotlarga indeks bo'yicha murojaat qilish

np.float64(38000.0)

In [ ]:
cars2.loc['Toyota'] # ma'lumotlarga indeks bo'yicha murojaat qilish

np.float64(45000.0)

In [ ]:
cars2.max() # max qiymat

52000.0

In [ ]:
cars2.min() # min qiymat

20000.0

In [ ]:
cars2.mean() # o'rtacha qiymat

np.float64(39000.0)